app/controllers/categories/dishes_controller.rb

  def index
    # authorize Category
    @dishes = @category.dishes.all
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."category_id" = ?  [["category_id", 2]]

  def create
    @dish = @category.dishes.new(dish_params)
    if @dish.save
---
INSERT INTO "dishes" ("nombre", "descripcion", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "arroz con pollo"], ["descripcion", ""], ["category_id", 2], ["created_at", "2020-08-25 18:55:06.866925"], ["updated_at", "2020-08-25 18:55:06.866925"]]

  def update
    if @dish.update(dish_params)
---
UPDATE "dishes" SET "existencia" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["existencia", 5], ["updated_at", "2020-08-25 19:08:33.360647"], ["id", 2]]

  def destroy
    @dish.destroy
---
DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 1]]

  def set_dish
    @dish = @category.dishes.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."category_id" = ? AND "dishes"."id" = ? LIMIT ?  [["category_id", 2], ["id", 1], ["LIMIT", 1]]

  def set_category
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]