app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("nombre", "descripcion", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Frutas"], ["descripcion", ""], ["created_at", "2020-08-25 19:33:28.337138"], ["updated_at", "2020-08-25 19:33:28.337138"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "nombre" = ?, "descripcion" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["nombre", "Lacteos"], ["descripcion", "leches"], ["updated_at", "2020-08-25 22:12:58.556198"], ["id", 5]]